/*
 🧩 ১️⃣ Rest Operator (...)
🧠 Function & Usage

Rest operator দিয়ে  একাধিক value কে একটা array তে সংগ্রহ করা যায়।
অর্থাৎ, “বাকি সব মান একসাথে ” — এই কাজটাই করে rest operator।
*/

// 🔍 TypeScript এ Type

function addNumbers(...numbers: number[]): number {
  return numbers.reduce((sum, num) => sum + num, 0);
}

// 👉 এখানে numbers এর টাইপ হলো number[] — মানে rest parameter সবসময় array টাইপ হয়।

// ********************************************

/* 🧩 ২️⃣ Spread Operator (...)
🧠 Function & Usage

Spread operator ঠিক উল্টো কাজ করে —
এটা একটা array বা object কে আলাদা আলাদা value তে “ছড়িয়ে দেয়”।

⚙️ Importance

Array বা object copy বা merge করতে।

Immutable ডেটা ম্যানিপুলেশন করতে (React এ খুব ব্যবহৃত)।

Props pass করার সময় React Component এ।

🔍 TypeScript এ Type
const numbers: number[] = [1, 2, 3];
const moreNumbers: number[] = [...numbers, 4, 5];


👉 এখানে TypeScript বুঝে নেয় moreNumbers এর টাইপও number[] হবে।

| বিষয়            | Rest Operator               | Spread Operator              |
| --------------- | ----------------------------| ---------------------------- |
| কাজ            | বাকি value গুলোকে একত্রে নেয় | value গুলোকে ছড়িয়ে দেয়       |
| ব্যবহারের জায়গা   | Function parameter          | Array, Object, Function call |
| রিটার্ন টাইপ       | সবসময় Array                | context অনুযায়ী ভিন্ন        |
| উদাহরণ          | `function sum(...nums)`     | `[...arr]`, `{...obj}`       |


*/
